In [58]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'c1':['a', 'a', 'b', 'a', 'b'],
                  'c2':[1, 1, 1, 2, 2],
                  'c3':[1, 1, 2, 2, 2]})

In [3]:
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [31]:
df_dup = df.duplicated(['c1','c3'], keep = 'last') # duplicated 인지 아닌지 행마다 판별한다

In [27]:
df_dup

0     True
1     True
2     True
3    False
4    False
dtype: bool

In [10]:
df2 = df.drop_duplicates() # 중복값이 있는 행 제거

In [33]:
df2          # 1행 제거

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [64]:
df_2= pd.read_csv('./auto-mpg.csv', header = None)

In [65]:
df_2.columns = ['mpg','cylinders','displacement','horsepower','weight',
              'acceleration','model year','origin','name']

In [66]:
print(df_2.head())
print()

    mpg  cylinders  displacement horsepower  weight  acceleration  model year  \
0  18.0          8         307.0      130.0  3504.0          12.0          70
1  15.0          8         350.0      165.0  3693.0          11.5          70
2  18.0          8         318.0      150.0  3436.0          11.0          70
3  16.0          8         304.0      150.0  3433.0          12.0          70
4  17.0          8         302.0      140.0  3449.0          10.5          70

   origin                       name
0       1  chevrolet chevelle malibu
1       1          buick skylark 320
2       1         plymouth satellite
3       1              amc rebel sst
4       1                ford torino

In [70]:
mpg_to_kpl = 0.621371

In [71]:
df_2['kpl'] = df_2['mpg'] * mpg_to_kpl
df_2.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,name,kpl
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu,11.184678
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320,9.320565
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite,11.184678
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst,9.941936
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino,10.563307

In [72]:
df_2['horsepower'].replace('?',np.nan,inplace = True)
df_2.dropna(subset = ['horsepower'],axis = 0 , inplace = True)
df_2['horsepower'] = df_2['horsepower'].astype('float')

In [73]:
print(df_2['horsepower'].dtypes)

float64

In [78]:
df_2['origin'].replace({1:'USA', 2:'EU', 3:'JPN'}, inplace = True)

In [80]:
df_2['origin'].unique()

array(['USA', 'JPN', 'EU'], dtype=object)

In [83]:
count, bin_dividers = np.histogram(df_2['horsepower'], bins = 3)

bin_names = ['저출력', '표준출력', '고출력']
df_2['hp_bin'] = pd.cut(x = df_2['horsepower'],
                     bins = bin_dividers,
                     labels = bin_names,
                     include_lowest= True)

In [84]:
horsepower_dummies = pd.get_dummies(df_2['hp_bin'])
print(horsepower_dummies.head())

   저출력  표준출력  고출력
0    0     1    0
1    0     1    0
2    0     1    0
3    0     1    0
4    0     1    0

# 정규화

In [86]:
# 1. 각 열 데이터를 해당열 데이터의 최댓값으로 나누는 방법           ex) 0~1000이라면, 각 열 VALUE들에 1/1000 을 곱해주는것

# 열의 통계정보 확인
print(df_2.horsepower.describe())
print()

count    392.000000
mean     104.469388
std       38.491160
min       46.000000
25%       75.000000
50%       93.500000
75%      126.000000
max      230.000000
Name: horsepower, dtype: float64

In [91]:
# horsepower 열의 모든 값들을 최댓값의 절댓값으로 나눠서 저장

df_2.horsepower = df_2.horsepower/abs(df_2.horsepower.max())
print(df_2.horsepower.head())
print()
print(df_2.horsepower.describe())

0    0.565217
1    0.717391
2    0.652174
3    0.652174
4    0.608696
Name: horsepower, dtype: float64

count    392.000000
mean       0.454215
std        0.167353
min        0.200000
25%        0.326087
50%        0.406522
75%        0.547826
max        1.000000
Name: horsepower, dtype: float64

In [92]:
#2.  (x - 최솟값)/ (최댓값 - 최솟값) 으로 정규화 하는 방법

max